---
kind: type
id: T:Autodesk.Revit.DB.InsulationLiningBase
source: html/938d1b57-b9bb-44b0-81ec-c22dff57fc8e.htm
---
# Autodesk.Revit.DB.InsulationLiningBase

Acts as the base class for duct insulation, pipe insulation and duct lining elements.

## Syntax (C#)
```csharp
public class InsulationLiningBase : MEPCurve
```